---
kind: other
id: Methods.T:Autodesk.Revit.DB.LocationPoint
source: html/4f7cac14-ad30-227f-a052-acc3e69ec8af.htm
---
# LocationPoint Methods

Causes the object to release immediately any resources it may be utilizing.